In [1]:
import pandas as pd
import sqlite3
tmpdb = sqlite3.connect('tmp5.db')
%load_ext sql
%sql sqlite:///tmp5.db
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
%%sql

CREATE TABLE IF NOT EXISTS Salesman (
  Salesman_id int PRIMARY KEY,
  name TEXT,
  city TEXT,
  Comission REAL
);

 * sqlite:///tmp5.db
Done.

[]

In [3]:
%%sql

INSERT INTO Salesman (Salesman_id, name, city, Comission) VALUES
  (5001, 'James Hoog', 'new york', 0.15),
  (5002, 'Nail Knite', 'paris', 0.13),
  (5005, 'Pit Alex', 'london', 0.11),
  (5006, 'Mc Lyon', 'paris', 0.14),
  (5007, 'Paul Adam', 'rome', 0.13),
  (5003, 'Lauson Hen', 'san jose', 0.12);

 * sqlite:///tmp5.db
6 rows affected.

[]

In [4]:
%%sql

CREATE TABLE IF NOT EXISTS Customer (
  customer_id int PRIMARY KEY,
  cust_name TEXT,
  city TEXT,
  grade int,
  Salesman_id int,
  FOREIGN KEY (Salesman_id) REFERENCES Salesman(Salesman_id)
);

 * sqlite:///tmp5.db
Done.

[]

In [5]:
%%sql

INSERT INTO Customer (customer_id, cust_name, city, grade, Salesman_id) VALUES
  (3002, 'nick rimando', 'new york', 100, 5001),
  (3007, 'brad davis', 'new york', 200, 5001),
  (3005, 'graham zusi', 'california', 200, 5002),
  (3008, 'julian green', 'london', 300, 5002),
  (3004, 'fabian johnson', 'paris', 300, 5006),
  (3009, 'geoff cameron', 'berlin', 100, 5003),
  (3003, 'jozy altidor', 'moscow', 200, 5007),
  (3001, 'brad guzan', 'london', NULL, 5005);

 * sqlite:///tmp5.db
8 rows affected.

[]

In [6]:
%%sql

CREATE TABLE IF NOT EXISTS Orders (
  ord_no int PRIMARY KEY,
  purch_amt REAL,
  ord_date TEXT,
  customer_id int,
  Salesman_id int,
  FOREIGN KEY (customer_id) REFERENCES Customer(customer_id),
  FOREIGN KEY (Salesman_id) REFERENCES Salesman(Salesman_id)
);

 * sqlite:///tmp5.db
Done.

[]

In [7]:
%%sql

INSERT INTO Orders (ord_no, purch_amt, ord_date, customer_id, Salesman_id) VALUES
  (70001, 150.5, '2012-10-05', 3005, 5002),
  (70009, 270.65, '2012-09-10', 3001, 5001),
  (70002, 65.26, '2012-10-05', 3002, 5003),
  (70004, 110.5, '2012-08-17', 3009, 5007),
  (70007, 948.5, '2012-09-10', 3005, 5005),
  (70005, 2400.6, '2012-07-27', 3007, 5006);

 * sqlite:///tmp5.db
6 rows affected.

[]

In [8]:
%%sql

SELECT Customer.cust_name, Salesman.name, Salesman.city
FROM Customer
JOIN Salesman ON Customer.city = Salesman.city;

 * sqlite:///tmp5.db
Done.

[('nick rimando', 'James Hoog', 'new york'),
 ('brad davis', 'James Hoog', 'new york'),
 ('julian green', 'Pit Alex', 'london'),
 ('fabian johnson', 'Mc Lyon', 'paris'),
 ('fabian johnson', 'Nail Knite', 'paris'),
 ('brad guzan', 'Pit Alex', 'london')]

In [9]:
%%sql 

SELECT Customer.cust_name, Salesman.name
FROM Customer
JOIN Salesman ON Customer.Salesman_id = Salesman.Salesman_id;

 * sqlite:///tmp5.db
Done.

[('nick rimando', 'James Hoog'),
 ('brad davis', 'James Hoog'),
 ('graham zusi', 'Nail Knite'),
 ('julian green', 'Nail Knite'),
 ('fabian johnson', 'Mc Lyon'),
 ('geoff cameron', 'Lauson Hen'),
 ('jozy altidor', 'Paul Adam'),
 ('brad guzan', 'Pit Alex')]

In [11]:
%%sql

SELECT Orders.ord_no, Customer.cust_name, Orders.customer_id, Orders.Salesman_id
FROM Orders
JOIN Customer ON Orders.customer_id = Customer.customer_id
JOIN Salesman ON Orders.Salesman_id = Salesman.Salesman_id
WHERE Customer.city <> Salesman.city;

 * sqlite:///tmp5.db
Done.

[(70001, 'graham zusi', 3005, 5002),
 (70009, 'brad guzan', 3001, 5001),
 (70002, 'nick rimando', 3002, 5003),
 (70004, 'geoff cameron', 3009, 5007),
 (70007, 'graham zusi', 3005, 5005),
 (70005, 'brad davis', 3007, 5006)]

In [12]:
%%sql 

SELECT Orders.ord_no, Customer.cust_name
FROM Orders
JOIN Customer ON Orders.customer_id = Customer.customer_id;

 * sqlite:///tmp5.db
Done.

[(70001, 'graham zusi'),
 (70009, 'brad guzan'),
 (70002, 'nick rimando'),
 (70004, 'geoff cameron'),
 (70007, 'graham zusi'),
 (70005, 'brad davis')]

In [13]:
%%sql

SELECT Customer.cust_name AS "Customer", Customer.grade AS "Grade"
FROM Orders
JOIN Salesman ON Orders.Salesman_id = Salesman.Salesman_id
JOIN Customer ON Orders.customer_id = Customer.customer_id
WHERE Customer.grade IS NOT NULL;

 * sqlite:///tmp5.db
Done.

[('graham zusi', 200),
 ('nick rimando', 100),
 ('geoff cameron', 100),
 ('graham zusi', 200),
 ('brad davis', 200)]

In [14]:
%%sql

SELECT Customer.cust_name AS "Customer",
Customer.city AS "City",
Salesman.name AS "Salesman",
Salesman.Comission
FROM Customer
JOIN Salesman ON Customer.Salesman_id = Salesman.Salesman_id
WHERE Salesman.Comission BETWEEN 0.12 AND 0.14;

 * sqlite:///tmp5.db
Done.

[('graham zusi', 'california', 'Nail Knite', 0.13),
 ('julian green', 'london', 'Nail Knite', 0.13),
 ('fabian johnson', 'paris', 'Mc Lyon', 0.14),
 ('geoff cameron', 'berlin', 'Lauson Hen', 0.12),
 ('jozy altidor', 'moscow', 'Paul Adam', 0.13)]

In [16]:
%%sql

SELECT Orders.ord_no, Customer.cust_name, Salesman.Comission AS "Commission%",
Orders.purch_amt * Salesman.Comission AS "Commission"
FROM Orders
JOIN Salesman ON Orders.Salesman_id = Salesman.Salesman_id
JOIN Customer ON Orders.customer_id = Customer.customer_id
WHERE Customer.grade >= 200;

 * sqlite:///tmp5.db
Done.

[(70001, 'graham zusi', 0.13, 19.565),
 (70007, 'graham zusi', 0.11, 104.335),
 (70005, 'brad davis', 0.14, 336.084)]

In [17]:
%%sql

SELECT *
FROM Customer
JOIN Orders ON Customer.customer_id = Orders.customer_id
WHERE Orders.ord_date = '2012-10-05';

 * sqlite:///tmp5.db
Done.

[(3005, 'graham zusi', 'california', 200, 5002, 70001, 150.5, '2012-10-05', 3005, 5002),
 (3002, 'nick rimando', 'new york', 100, 5001, 70002, 65.26, '2012-10-05', 3002, 5003)]